Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedSelfweightLoad Methods
The AnalysisDecomposedSelfweightLoad type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis decomposed selfweight load.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisDecomposedSelfweightLoad Class
Tekla.Structures.Analysis Namespace